spec/fixtures/vcr_cassettes/fill_in_information_from_Stripe.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/recipients
    body:
      encoding: US-ASCII
      string: name=Joe%20Sak&type=individual&bank_account[country]=US&bank_account[routing_number]=110000000&bank_account[account_number]=000123456789
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.15.0
      Authorization:
      - Bearer sk_test_UU7bBFT4BMFznL5a35ZE0CIx
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.15.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Josephs-Air-2.att.net 14.0.0 Darwin Kernel Version 14.0.0: Tue Sep 23 23:01:41
        PDT 2014; root:xnu-2782.1.97~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '136'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 06 Oct 2014 17:16:56 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '683'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - 2bb43098-a9bb-4963-95dd-c1e074b73daa
      Stripe-Version:
      - '2014-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "rp_14kf6S2L7z1ZOsnra4yraBT4",
          "object": "recipient",
          "created": 1412615816,
          "livemode": false,
          "type": "individual",
          "description": null,
          "email": null,
          "name": "Joe Sak",
          "verified": false,
          "metadata": {},
          "active_account": {
            "object": "bank_account",
            "id": "ba_14kf6S2L7z1ZOsnrprvN0f1L",
            "last4": "6789",
            "country": "US",
            "currency": "usd",
            "status": "new",
            "fingerprint": "XJGQs2pPWYzzow5E",
            "bank_name": "STRIPE TEST BANK"
          },
          "cards": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/recipients/rp_14kf6S2L7z1ZOsnra4yraBT4/cards",
            "data": []
          },
          "default_card": null
        }
    http_version: 
  recorded_at: Mon, 06 Oct 2014 17:16:56 GMT
recorded_with: VCR 2.9.3
